DataProcessors/ЗагрузкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанных</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорX</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>12</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорY</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>12</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресНаКарте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгружатьВТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Mapx_CLIENTS_TYPE_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Mapx_DISPATCH_CENTER_ID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ориентир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаДанных/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПереносНаСервере()
	ЕстьНомер=Истина;
	СтрНом=0;
	Пока ЕстьНомер Цикл
		СтрНом=СтрНом+1;
		Если  ТД.Область(СтрНом,1).Текст<>"" тогда
			Если  ТД.Область(СтрНом,9).Текст<>"" и ТД.Область(СтрНом,10).Текст<>"" тогда
			СтрТЗ=ТЗ.Добавить();
			СтрТЗ.Код= ТД.Область(СтрНом,1).Текст ;
			СтрТЗ.Название= ТД.Область(СтрНом,2).Текст ;
			СтрТЗ.Город= ТД.Область(СтрНом,3).Текст ;
			СтрТЗ.Район= ТД.Область(СтрНом,4).Текст ;
			СтрТЗ.Территория= ТД.Область(СтрНом,5).Текст ;
			СтрТЗ.Адрес= ТД.Область(СтрНом,6).Текст ;
			СтрТЗ.Ориентир= ТД.Область(СтрНом,7).Текст ;
			СтрТЗ.Группа= ТД.Область(СтрНом,8).Текст ;
			СтрТЗ.ИНН= ТД.Область(СтрНом,9).Текст ;
			СтрТЗ.GPS= ТД.Область(СтрНом,10).Текст ;
			Мас=СтрРазделить(СтрТЗ.GPS,",");
			Для каждого Коры Из Мас Цикл
			    С=Число(Коры);
				Если С>50 Тогда
					СтрТЗ.Х=С;
				Иначе
					СтрТЗ.У=С;
				КонецЕсли;	
			КонецЦикла; 
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН";
			
			Запрос.УстановитьПараметр("ИНН",СтрТЗ.ИНН );
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
			    Клиент=Выборка.Ссылка.ПолучитьОбъект();
				Клиент.КорX=СтрТЗ.Х;
				Клиент.КорY=СтрТЗ.У;
				Клиент.Записать();
			КонецЦикла;
			
			КонецЕсли;
		Иначе
			ЕстьНомер=Ложь
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Перенос(Команда)
	ПереносНаСервере();
КонецПроцедуры
